Repository: PHalfStudio/ScrollBridge
Catalog: MouseBridge/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# scroll.preserveTrackpad.desc
source: Trackpad two-finger scrolling is not changed.
zh_hans: 不改变触控板双指滚动方向。

# scroll.reverseHorizontal
source: Reverse horizontal scrolling
zh_hans: 反转水平滚动

# scroll.reverseHorizontal.desc
source: Off by default for safer compatibility.
zh_hans: 默认关闭，避免误处理横向区域。

# scroll.reverseMouseWheel
source: Reverse physical mouse wheel
zh_hans: 反转物理鼠标滚轮

# scroll.reverseMouseWheel.desc
source: Makes mouse wheel direction closer to Windows while keeping trackpad natural scrolling.
zh_hans: 让鼠标滚轮方向接近 Windows，同时保持触控板自然滚动。

# scroll.reverseVertical
source: Reverse vertical scrolling
zh_hans: 反转垂直滚动

# scroll.reverseVertical.desc
source: Applies to standard physical wheel events.
zh_hans: 作用于标准物理滚轮事件。

# section.actions
source: Actions
zh_hans: 操作

# section.basic
source: Basic
zh_hans: 基础

# section.excludedApps
source: Excluded Apps
zh_hans: 排除 App

# section.language
source: Language
zh_hans: 语言

# section.scrollDirection
source: Scroll direction
zh_hans: 滚动方向

# section.smoothScroll
source: Smooth scrolling
zh_hans: 平滑滚动

# smooth.curve
source: Curve
zh_hans: 滚动曲线

# smooth.curve.easeOut
source: Ease out
zh_hans: 缓出

# smooth.curve.hint
source: Choose the timing curve used for smooth scrolling.
zh_hans: 选择平滑滚动使用的时间曲线。

# smooth.curve.linear
source: Linear
zh_hans: 线性

# smooth.duration
source: Duration
zh_hans: 持续时间

# smooth.duration.hint
source: Adjust how long each smooth scroll animation lasts.
zh_hans: 调整每次平滑滚动动画的持续时间。

# smooth.duration.valueFormat
source: %d ms
zh_hans: %d 毫秒

# smooth.enabled
source: Enable smooth scrolling
zh_hans: 启用平滑滚动

# smooth.enabled.desc
source: Splits a physical wheel tick into smaller pixel scroll events.
zh_hans: 把一次物理滚轮刻度拆成更细的像素滚动事件。

# smooth.hint.balanced
source: Balanced
zh_hans: 均衡

# smooth.hint.direct
source: More direct
zh_hans: 更直接

# smooth.hint.soft
source: Softer
zh_hans: 更柔和

# smooth.horizontal
source: Smooth horizontal scrolling
zh_hans: 平滑水平滚动

# smooth.horizontal.desc
source: Kept off by default for predictable horizontal areas.
zh_hans: 默认关闭，让横向区域表现更稳定。

# smooth.inertia
source: Inertia simulation
zh_hans: 惯性模拟

# smooth.inertia.desc
source: Adds a short decaying tail after each wheel tick.
zh_hans: 在每次滚轮输入后追加短促递减尾段。

# smooth.speedMultiplier
source: Speed multiplier
zh_hans: 速度倍率

# smooth.speedMultiplier.hint
source: Adjust the strength multiplier applied to smooth scroll output.
zh_hans: 调整平滑滚动输出的力度倍数。

source: Smooth steps
zh_hans: 平滑步数

# smooth.steps.hint
source: Adjust how many synthetic scroll steps are generated for each wheel event.
zh_hans: 调整每次滚轮事件生成的平滑滚动步数。

# status.enabled
source: Enabled
zh_hans: 已启用

# status.missingPermissions
source: Missing permissions
zh_hans: 缺少权限

# status.paused
source: Paused
zh_hans: 已暂停

# status.setupRequired
source: Setup required
zh_hans: 需要完成设置

# window.about
source: About ScrollBridge
zh_hans: 关于 ScrollBridge

# window.settings
source: ScrollBridge Settings
zh_hans: ScrollBridge 设置
